# Project 3

**This project will connect to the Chinook database (downloaded locally) and query using SQL to create a pandas DataFrame that displays Customers' Last Name and First Name, and each customer’s purchased Track names and Album Titles.  Only the first 5 items will be listed.**

**First we connect to the database.**

In [1]:
import sqlalchemy as sqla
import pandas as pd

db = sqla.create_engine('sqlite:///Chinook_Sqlite.sqlite')

***Next we query the database to find the table names.***

In [2]:
tablequery = "SELECT tbl_name FROM sqlite_master WHERE type = 'table'"
tables = pd.read_sql(tablequery, db)
tables

         tbl_name
0           Album
1          Artist
2        Customer
3        Employee
4           Genre
5         Invoice
6     InvoiceLine
7       MediaType
8        Playlist
9   PlaylistTrack
10          Track

**Next we query each table to find the structure of the data.**

In [3]:
tablenames = tables['tbl_name'].tolist()
for i in tablenames:
    print pd.read_sql_table(i, db).head(1)

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
   ArtistId   Name
0         1  AC/DC
   CustomerId FirstName   LastName  \
0           1      Luís  Gonçalves

                                            Company  \
0  Embraer - Empresa Brasileira de Aeronáutica S.A.

                           Address                 City State Country  \
0  Av. Brigadeiro Faria Lima, 2170  São José dos Campos    SP  Brazil

  PostalCode               Phone                 Fax                 Email  \
0  12227-000  +55 (12) 3923-5555  +55 (12) 3923-5566  luisg@embraer.com.br

   SupportRepId
0             3
   EmployeeId LastName FirstName            Title  ReportsTo  BirthDate  \
0           1    Adams    Andrew  General Manager        NaN 1962-02-18

    HireDate              Address      City State Country PostalCode  \
0 2002-08-14  11120 Jasper Ave NW  Edmonton    AB  Canada    T5K 2N1

               Phone                Fax                   Email
0  +1 (780) 428-9482  +1 (780) 428-3457  andrew@chinookcorp.com
   GenreId  Name
0        1  Rock
   InvoiceId  CustomerId InvoiceDate           BillingAddress BillingCity  \
0          1           2  2009-01-01  Theodor-Heuss-Straße 34   Stuttgart

  BillingState BillingCountry BillingPostalCode  Total
0         None        Germany             70174   1.98
   InvoiceLineId  InvoiceId  TrackId  UnitPrice  Quantity
0              1          1        2       0.99         1
   MediaTypeId             Name
0            1  MPEG audio file
   PlaylistId   Name
0           1  Music
   PlaylistId  TrackId
0           1     3402
   TrackId                                     Name  AlbumId  MediaTypeId  \
0        1  For Those About To Rock (We Salute You)        1            1

   GenreId                                   Composer  Milliseconds     Bytes  \
0        1  Angus Young, Malcolm Young, Brian Johnson        343719  11170334

   UnitPrice
0       0.99

**From this we see that we will need to join the relevant information from Customers, Invoice, InvoiceLine, Track and Album to get the requested results.**

In [4]:
query = '''SELECT Customer.LastName, Customer.FirstName, Track.Name, Album.Title
               FROM Customer
               LEFT JOIN Invoice ON Customer.CustomerId = Invoice.CustomerId
               LEFT JOIN InvoiceLine ON Invoice.InvoiceId = InvoiceLine.InvoiceId
               LEFT JOIN Track ON InvoiceLine.TrackId = Track.TrackId
               LEFT JOIN Album ON Track.AlbumId = Album.AlbumId
               ORDER BY Customer.LastName, Customer.FirstName'''
pd.read_sql(query, db).head()

,LastName,FirstName,Name,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas